app/Models/UmkmModel.php

SELECT *
FROM `tb_umkm`
---
    public function all_data()
    {
        return $this->db->table('tb_umkm')->get()->getResultArray();